/** @format */

export const listData = [
  {
    title:
      "2. Сўнгги уч-тўрт кун ичида сизни бош оғриги ёки айланиши безовта қилган ҳолат кузатилдими?",
    isNot: false,
    isYes: false,
    sometimes: false,
    isClicked: false,
    id: 1,
  },
  {
    title:
      "3. Қайта-қайта ўқиган маълумотларингиз бирдан ёдингиздан чиқиб қоляптими?",
    isNot: false,
    isYes: false,
    sometimes: false,
    isClicked: false,
    id: 2,
  },
  {
    title: "4. Кечалари ярим тунгача ухлолмай қийланасизми?",
    isNot: false,
    isYes: false,
    sometimes: false,
    isClicked: false,
    id: 3,
  },
  {
    title:
      "5. Кунлик овқатланиш рационингиз, асосан, нималардан ташкил топган?",
    isNot: false,
    isYes: false,
    sometimes: false,
    isClicked: false,
    id: 4,
  },
];

export const analyzeResultData = [
  {
    id: 1,
    content: "ISNOT",
    title:
      "Табриклаймиз, натижаларингиз ижобий. Бироқ шунга қарамасдан қуйидаги маслаҳатларга доимий равишда амал қилиб боришингиз керак эканлигини эслатиб ўтамиз:",
    recommendList: [
      { text: "Спорт билан шуғулланинг;" },
      { text: "Организмни витаминлар билан тўйинтиринг;" },
      { text: "Зарарли одатлардан воз кечинг;" },
      { text: 'Алҳадая" маҳсулотини истеъмол қилинг.' },
    ],
  },
  {
    id: 2,
    content: "SOMETIMES",
    title:
      "Сизда қон босими билан боғлиқ муаммоларнинг илк аломати юзага келаётган бўлиши мумкин. Касалликни олдини олиш учун фурсатни бой бермаган ҳолда чора кўришингиз лозим. Бу борада сизга қуйидаги тавсиялар ёрдам беради:",
    recommendList: [
      {
        text: "Спиртли ичимликлар, тамаки маҳсулотлари, чой ва қаҳва истеъмолидан буткул воз кечинг;",
      },
      { text: "Мунтазам равишда жисмоний машқлар билан шуғулланинг;" },
      { text: "Туз ва ҳайвон ёғлари истеъмолини имкон қадар камайтиринг;" },
      { text: "Ва албатта, ,,Алҳадаяъъ маҳсулотларини истеъмол қилинг!" },
    ],
  },
  {
    id: 3,
    content: "ISYES",
    title:
      "Сизда катта эҳтимол билан қон босими билан боғлиқ муаммолар аллақачон юзага келиб бўлган. Касалликка қарши курашиш учун яшаш тарзингизни ўзгартириш ва саломатлигингизга жиддий эътибор беришингиз керак. Бу борада бизнинг қуйидаги тавсияларга амал қилишни унутманг:",
    recommendList: [
      {
        text: "Спиртли ичимликлар, тамаки маҳсулотлари, чой ва қаҳва истеъмолидан буткул воз кечинг;",
      },
      { text: "Мунтазам равишда жисмоний машқлар билан шуғулланинг;" },
      { text: "Туз ва ҳайвон ёғлари истеъмолини имкон қадар камайтиринг;" },
      { text: "Ва албатта, ,,Alhadaya'' маҳсулотларини истеъмол қилинг!" },
    ],
  },
];
